; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-5-2-225)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p4-1 - location
	p4-3 - location
	p4-5 - location
	p5-1 - location
	p5-2 - location
	p3-1 - location
	p0-3 - location
	p0-5 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s4)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s5)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s2)
	(at package2 s1)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 29)
	(= (time-to-walk p4-1 s4) 29)
	(= (time-to-walk s1 p4-1) 6)
	(= (time-to-walk p4-1 s1) 6)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 44)
	(= (time-to-walk p4-3 s4) 44)
	(= (time-to-walk s3 p4-3) 38)
	(= (time-to-walk p4-3 s3) 38)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 9)
	(= (time-to-walk p4-5 s4) 9)
	(= (time-to-walk s5 p4-5) 51)
	(= (time-to-walk p4-5 s5) 51)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 73)
	(= (time-to-walk p5-1 s5) 73)
	(= (time-to-walk s1 p5-1) 22)
	(= (time-to-walk p5-1 s1) 22)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 6)
	(= (time-to-walk p5-2 s5) 6)
	(= (time-to-walk s2 p5-2) 68)
	(= (time-to-walk p5-2 s2) 68)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 13)
	(= (time-to-walk p3-1 s3) 13)
	(= (time-to-walk s1 p3-1) 56)
	(= (time-to-walk p3-1 s1) 56)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 59)
	(= (time-to-walk p0-3 s0) 59)
	(= (time-to-walk s3 p0-3) 54)
	(= (time-to-walk p0-3 s3) 54)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 30)
	(= (time-to-walk p0-5 s0) 30)
	(= (time-to-walk s5 p0-5) 74)
	(= (time-to-walk p0-5 s5) 74)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 67)
	(= (time-to-drive s0 s1) 67)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 13)
	(= (time-to-drive s1 s4) 13)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 9)
	(= (time-to-drive s2 s4) 9)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 11)
	(= (time-to-drive s0 s5) 11)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 47)
	(= (time-to-drive s1 s5) 47)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 23)
	(= (time-to-drive s2 s5) 23)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 74)
	(= (time-to-drive s3 s5) 74)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 57)
	(= (time-to-drive s4 s5) 57)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 10)
	(= (time-to-drive s4 s0) 10)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 63)
	(= (time-to-drive s0 s3) 63)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 64)
	(= (time-to-drive s1 s3) 64)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at truck2 s1)
	(at truck3 s1)
	(at truck5 s2)
	(at package1 s4)
	(at package2 s3)
	))

(:metric minimize (+ (* 1 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver1 truck3 s1)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 1 of 6
2. (load-truck package2 truck3 s1)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 1 of 6
3. (walk driver2 s4 p4-5)
   deleted: (at driver2 s4)
   added: (at driver2 p4-5)
   goals met: 1 of 6
4. (walk driver2 p4-5 s5)
   deleted: (at driver2 p4-5)
   added: (at driver2 s5)
   goals met: 1 of 6
5. (drive-truck truck3 s1 s4 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 0 to 143
   goals met: 0 of 6
6. (drive-truck truck3 s4 s2 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (fuel-used) from 143 to 242
   goals met: 0 of 6
7. (load-truck package1 truck3 s2)
   deleted: (at package1 s2)
   added: (in package1 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 0 of 6
8. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 0 of 6
9. (drive-truck truck3 s2 s4 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (fuel-used) from 242 to 359
   goals met: 0 of 6
10. (drive-truck truck2 s5 s1 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 359 to 829
   goals met: 1 of 6
11. (unload-truck package1 truck3 s4)
   deleted: (in package1 truck3)
   added: (at package1 s4)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 2 of 6
12. (drive-truck truck3 s4 s1 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (fuel-used) from 829 to 972
   goals met: 3 of 6
13. (drive-truck truck2 s1 s5 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (fuel-used) from 972 to 1442
   goals met: 2 of 6
14. (drive-truck truck3 s1 s3 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (fuel-used) from 1442 to 2146
   goals met: 1 of 6
15. (unload-truck package2 truck3 s3)
   deleted: (in package2 truck3)
   added: (at package2 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 2 of 6
16. (drive-truck truck3 s3 s5 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (fuel-used) from 2146 to 2886
   goals met: 2 of 6
17. (disembark-truck driver1 truck3 s5)
   deleted: (driving driver1 truck3)
   added: (at driver1 s5) (empty truck3)
   goals met: 2 of 6
18. (board-truck driver1 truck5 s5)
   deleted: (at driver1 s5) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 2 of 6
19. (drive-truck truck5 s5 s2 driver1)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   changed: (fuel-used) from 2886 to 3116
   goals met: 3 of 6
20. (disembark-truck driver1 truck5 s2)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 4 of 6
21. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 4 of 6
22. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 4 of 6
23. (drive-truck truck3 s5 s1 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 3116 to 3586
   goals met: 5 of 6
24. (walk driver1 s2 p5-2)
   deleted: (at driver1 s2)
   added: (at driver1 p5-2)
   goals met: 4 of 6
25. (walk driver1 p5-2 s5)
   deleted: (at driver1 p5-2)
   added: (at driver1 s5)
   goals met: 4 of 6
26. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 6
27. (drive-truck truck2 s5 s1 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 3586 to 4056
   goals met: 5 of 6
28. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 5 of 6
29. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 5 of 6
30. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 6
31. (drive-truck truck2 s1 s5 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (fuel-used) from 4056 to 4526
   goals met: 4 of 6
32. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 4 of 6
33. (walk driver1 s1 p5-1)
   deleted: (at driver1 s1)
   added: (at driver1 p5-1)
   goals met: 4 of 6
34. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 6
35. (drive-truck truck2 s5 s1 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 4526 to 4996
   goals met: 5 of 6
36. (walk driver1 p5-1 s5)
   deleted: (at driver1 p5-1)
   added: (at driver1 s5)
   goals met: 5 of 6
37. (walk driver1 s5 p5-2)
   deleted: (at driver1 s5)
   added: (at driver1 p5-2)
   goals met: 5 of 6
38. (walk driver1 p5-2 s2)
   deleted: (at driver1 p5-2)
   added: (at driver1 s2)
   goals met: 6 of 6
